export const INTERVIEWS = [
  {
    question: "Q. 개발자를 시작하게 된 계기가 무엇인가요?",
    answer:
      "전기 공학을 전공하며 논리적인 사고를 배웠지만, 제가 작성한 코드가 즉각적으로 화면에 반영되고 사용자와 상호작용하는 웹 개발에 더 큰 매력을 느꼈습니다. 특히 무언가를 직접 만들어내는 창작의 즐거움이 개발을 시작하게 된 가장 큰 계기입니다.",
  },
  {
    question: "Q. 프로젝트를 하면서 가장 인상 깊었던 상황을 말해주세요",
    answer:
      "실시간 채팅 서비스를 구현할 때 웹소켓 연결 끊김 현상을 해결했던 경험이 기억에 남습니다. 단순히 라이브러리를 사용하는 것을 넘어, 연결 생명주기를 관리하고 예외 처리를 하며 프로토콜에 대한 이해를 높일 수 있었습니다.",
  },
  {
    question: "Q. 10년 후 어떤 개발자가 되어 있을 것 같나요?",
    answer:
      "단순히 기능을 구현하는 개발자를 넘어, 비즈니스 가치를 창출하고 동료 개발자들에게 긍정적인 기술적 영감을 주는 테크 리드가 되어있고 싶습니다.",
  },
];
